{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "f6813901",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from neo4j import GraphDatabase\n",
    "import datetime\n",
    "from datetime import timedelta\n",
    "pd.set_option('display.max_colwidth', None)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "34affdf8",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Establish connection to Neo4j\n",
    "df_pw = pd.read_csv(\"pw.csv\", delimiter=\",\")\n",
    "db = GraphDatabase.driver(\"neo4j://127.0.0.1:7687\", auth=(df_pw[\"name\"][0], df_pw[\"password\"][0]))\n",
    "session = db.session()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "699f992c",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Load wallets of vendors known to be active on both Berlusconi & Cryptonia Market as well as all positive BM reviews.\n",
    "vendor_wallets = pd.read_csv('vendor_wallets_filtered2.csv')\n",
    "berlusconi_reviews  = pd.read_csv('reviews_price_btc.csv')\n",
    "berlusconi_reviews.time = pd.to_datetime(berlusconi_reviews.time)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "46d32434",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['e95f53d3eead4f89ec569dd37638030d8515eefed8593a5330aa0b6d7ac39a45',\n",
       " 'caa10bfd483632ba44aa6c860e2f30cab581341b21c819d316b99f0e277bb4f6',\n",
       " '57e34d74f1cd5528253c28ccd938c2a9307545b9a2263cecb29cc75941bbe02a',\n",
       " '0b9d70cf1e2a70e0f33b4620deb5f6afde7c3547774a3d4ee5e973aeb873a31e',\n",
       " '433e1b460e8d67e5fa55aa780154cc27080b5635132c179887795b419b80010b',\n",
       " '972c2b76db5127b11421ea4508ca5d07f044f4e12eaf4123b40e8cb1bb15f719',\n",
       " 'd3b1ddda7c8f57109d77cb5817e894f87f2292ee58c30b423b6411dff911e90e',\n",
       " 'b864b9953a392264793c4ef9cd9b2075154d6777492a6b755227ff3209fb9083',\n",
       " '689a4b8511c88a9dcd5f766dd42d1d2f1524aeb80c57eb1a169c874549592bd9',\n",
       " 'b76e50c92da657c31b2fdb30eced4013f0f7ee997901d161da4bb08cec4da424',\n",
       " '272ee0bad42e4c63d8625ca1bcf6e233d4233ffba28a958bf93a1db3e2ebe20d',\n",
       " 'f05773d24f31ac444b6da4fa117ab0ebc44e01e2f5081360c46794b997d5c74c',\n",
       " '063a367c377d4df9041ceb9702d20c7969cdbdeabab4f195d0c24b714f668a16',\n",
       " '51f8ee15f6746e67df3b333d45bcda27e3028d5bdc6358d1c4366de28fa43c1e',\n",
       " '5a4e70abffa7e043e349921546ab686b157f08291fd49de2be0070b9d3205419',\n",
       " '587932f9f8375e9ff83e878eaf4f350143cf884ee329c44a80e50a8f652c5a44',\n",
       " 'ed1ad635e94ddfad13fd91c839b5ec371c8143706a92e9f13ae0672e4ad28b4e',\n",
       " '674af17de18d7e93a45fcceb87c44fe066a4fdd269ed2328c4c5e407f930995d',\n",
       " 'b33229e26983fc0f93fee0a50b4b7f0de7e721fa79eeba92e9b407821ebf9764',\n",
       " '92c2ef589a6c2de876a78ae99254d6d8f7d1906229aa800ffc571aff89075833',\n",
       " 'e4c418819b580756891886ae9706969f4d3f4525aafc3dbd65d66cc73145f3c7',\n",
       " '05f3683ef1ad2de0b4fc900c2c6edabb39057d60fc83cdd864f40a7e92eb728f',\n",
       " 'fdb03e0353e968a6a2c54548b871c309991fb326325678057ffea246582d75d7',\n",
       " 'd4cf9692aaee1001b0b88b33b8215b2341d8ca41e69ebf1edf57c08341f916f4',\n",
       " '622b03dfde748d50b6c77ccb240fe8b47907a1bff373f42899ff8b4b89bf1783',\n",
       " '22a14c778414551060f2676e446c45b7f7e5f6f20e5c6b4a29f5e3796dd8dc99',\n",
       " '9c517d97b92f65a4c4ca93e64e06c123c1be3c16ea203d78c7953a7d5133adf9',\n",
       " '5fc42b175a115db8857bea4889a8d58cb092942719e3aa9d7ad053b29f785aea',\n",
       " '16c5a50bca02ab0af920e62c7a5ed8e1975d1dfad5b4fb524c49db879b801bf9',\n",
       " '260fb43fe61058f618b369b5b508a7dbe9bfa5e1c1e1ce476216c164589c8bbe',\n",
       " '718c68e000e8557339433b5f4453dde186b5d159af802d66af0edb6d2762d1f9',\n",
       " '25cdee65481a1bcfd72b270a6108e9a862cc8c54b9131120d4910db553309fc8',\n",
       " '5ba13718fe32ffb9ac082293e6ce302a6fc09e66f8f3a18932ff32ebdee5696a',\n",
       " '1607f070381508b6dbbe57893097f55fa9b11b9223df03179ca8a391de123204',\n",
       " '6ef8542c833d895b6341e4466b84fbc944147a97ea7808f8a6f9c1682be3f96e',\n",
       " '06ea9636459a60a0781f1f3833267110b74e77a93be8888ad5ded71c6b710def',\n",
       " '7bd4caa3ae59b8ddac572b13ee2ab513c8051feafed9d194913dffe2c02578a9',\n",
       " '657ce039232e53fed1d9e9ec6bdb625907ea891b76023964b395e236521c0daa',\n",
       " '29df9adc994a93b4c92979a759723aa5986593ee371dcefc6a73130d184f8faf',\n",
       " '2b2392dc1daecda593d70e3368e8c9d61ab3f8317ba71566b09373f54e544b66',\n",
       " '8067921447312557c0ad4aabc28653b7600822f39ec75e0098a37ef63f13132c',\n",
       " '5c6224dbcc2c47b929ec918bdc77a5a5990cbd9686047cf5c7c242912da0aebd',\n",
       " 'c55e7812fc17ae0135e6eca592c194916eabed469445e2751a7b58f5994b3643',\n",
       " '86f159d4f5ece010042fdd8ba9028dfa34c3e6b8b4184e0b45d17879a0935826',\n",
       " '8e5ad046ce1ebb94676d12a03e01386334bb33c7adb8349f8242142e986e9c27',\n",
       " 'b8cf5478f8e5b3ca6bcd3173c8d31513bf436751ae0eac16557764359a50182e',\n",
       " '489259b347c178eb4f9f74ac2d207db053f06a003efe71a2df1d21b3c0336998',\n",
       " '8b7c9381a9f377a1f36650e8320320f01084badb246a1cb59c91bd44ed77c370',\n",
       " '8570ba8c456fb8d8ce5bdd087a420d9b8d580a65052b8e57bcb3ea3c7558d31e',\n",
       " 'a4a86320cef6da36f26d3890c8ba7e180c1a8b85baa5e82e6eec2131690925f1',\n",
       " '4b07492148145be79b347c967961374edcfb9c9003d15841c177e258bf0abbb6',\n",
       " '35cec580e38d2ed04b3ebfe800f7702af825cdba362d9b97112252a629899092',\n",
       " 'da6e8017e060ce3075bf0ad36ff03c01459e25e141f8db78c39024878173b12b',\n",
       " '6aac753fe1d0bd27a5f5db929a999491c3666edf0d7dc548cf2e2af838b3523c',\n",
       " 'a9c5151a5fce5ef9238104e9b2e855abb05a382f7efaed8ae753132d52670d28',\n",
       " 'db37a4a151c0f5a74d05f5298dc8b73d064ba6751fa6373442a890cec90c42c4',\n",
       " '950024ca5ddc4377eec8c64a8d10e4f7486e2d0227a9d9542a05ce43a110a486',\n",
       " 'b1a2d78d926c227dee53642ec09de708b71e372c826730dad93fc03c1c21c8ec',\n",
       " '087614007693a3f56a0ba7586ac11babcb8aac82f583d0f36c45bac68b1a45ea',\n",
       " 'ec43d159cb125d43cbfc7a9694da18f63f5b67a8a282a7bbfe82cd10aba7fe6f',\n",
       " 'b3cfcf29788a4d244886966f1285feb17a5728bd37a15262f7a9a3b93f96b88d',\n",
       " 'fc5dfddbafbfffd691a73d1e448886816211466440a00bb9d90f96960a37957e',\n",
       " 'e72fd33a6810199809a539ab94e532222934f288479fafe14081095b2e4dcb4e',\n",
       " 'a840d33e66c8144aa674f1f130dc84644a684d5b9abf12a1dae4c3b340b172ff',\n",
       " 'eaa3100fa3978a2c108580c99f69df83a1b82532e7ba852f44d29019779c6908',\n",
       " 'c54c234e4e37feb1447f1a41ca6fd7293ce3af2ca3dd53c99a24007534b810fd',\n",
       " '9485ed70c5454f6cf28bc8ff69bc6c366b3c6fb31b864568b8a7b722ab08af8a',\n",
       " '61fae77e97ff4d4d7079b5c645d7bd56bb7e2ef91c1bd5b6db3c35fa6b1847fe',\n",
       " '9ab64f5da227f5f6f992bb5ca5b31f89f23d9b3388652b1bfae6193ac1e49ac2',\n",
       " 'b41e9fae59d2ae8d79d2f1f434d3fc7e2a0dacb9b86da096077bed8ccd9b7658',\n",
       " '9f4796570d9cbaf6e0cb40a57e562a00ed93c92ad8b662404ebc915afc0915a5',\n",
       " '8e97321b2e987167bc5a3e2ba80d9a37c9bc723d3d2fe23cd4e074332732b9b8',\n",
       " '92b8cd68e73a55cb9208b13099a61df3741bee1f5ef765aa4a3c312564bd37d2',\n",
       " '0debe14ba12bc429ac4933dc61aa64695ee1e7e41ed9e9477e2e4382527a063b',\n",
       " '1163bc887488700e3e1e89e257695ad32e11cbe4a474c7bb95a9ed3f45dec7b8',\n",
       " 'aec772f1a01634f8619376eccdeca8c58d433ea66211ebdd580fbbb0fc2d443e',\n",
       " '9a98e5826faa8b53cfe7e30c54711f77e0ae9d60fe33b5fd4ccd7e68c2333d58',\n",
       " 'bee1c178b87e8c92ec2fd4c711974173bf5d00c1b6d21b1cb04b2c9b0ae8c9fa',\n",
       " 'c736b4dc15a36361fbf7ad468fb90afa54d96039ee2095923379b9f9d77d6a7b',\n",
       " 'd8869b7b6412e1da5135545caf063ac9478ff6889e6325295f7945cc817c4790',\n",
       " 'eb541776f6e08fd0f97e8e24c4598ec7bc14015a6df6719ceafcbf068ca9842b',\n",
       " '329db2113aafbb6cd3101fc1951706b3f08921c8efbaf7da46586236c0cb0fff',\n",
       " '3510ef8a9cd4aff04dcde5333eba7489e4e4d1c526086f8dcda21db6a876a842',\n",
       " 'f867c4461b0859c98a2aa1a6d6d03245bb8f181034df7cd114479b3a6b7d53ee',\n",
       " '5db3d6f640ac10531be517f55faafb1251e264f24da1ce0320ff99f230803df2',\n",
       " 'eb995106afc077aab987dc2c541222d3c26ab1a5d65695aa803e1b043b7ea6c5',\n",
       " '7b8d6e19864889cb639efe748f7d05840ace40f8353ca77660d96a04132ace1b',\n",
       " '499c8baa01cfc16247307229771146432bcca6dbf90f7f8ad021cda1ab037fe8',\n",
       " '11791934edee64ff84ee75f388e913769cba31a864f27ff5fb6f8f97a4947d14',\n",
       " 'a3c3faae02f6ecacd90c54e566bf0986be0c9305f28edb365bd7bb383aa795a5',\n",
       " 'c50b8a6c2acc46ff29c7a482b2e25f5c43e4a984a70aa99cbb9d15d6477000bc',\n",
       " 'd60e2facc58a08964b5fba54781f7bdece496b5ce7c62c72cbdced77cac7ac8e',\n",
       " '5720f40d9e715b8d45b9542c7cfe20dae6c2da59b216579e91ae414c44b1bbe2',\n",
       " 'e881185352e12f6b5f21cd0e0aec768d7e3c4d52d7f16b0f6949436fd13fbbc2',\n",
       " '877c3f133ea6c44d51b8eca459729b50ea9107e89202b3b92fe0ac7c6073e5df',\n",
       " '62170a7572c8655b03c53c3c443fe7c90d0214c7befe6b4933c0d29259a3459d',\n",
       " 'b30bed74e02e0d8f39315e3c58837278e23a81fb534ce810726bf67506ae8a66',\n",
       " 'b30bed74e02e0d8f39315e3c58837278e23a81fb534ce810726bf67506ae8a66',\n",
       " '4448b547dfdc1882410c0b872efb1a1010dee11797c3536dddbd976d999c52b0',\n",
       " 'adcb30acc502f9a6979226d830c9c36401777eb258038a35fff6b30145dd1462',\n",
       " '6f133d412c94f4e3d5b876aaf93d490dda9516a752d99ca0e616a36c6725a4cf',\n",
       " '974a8ddc9faa84905bfd082df83405edbbc90ed0ce11eba00f2cb1f55533cadf',\n",
       " 'f267bf24695cc19a0d7892be23e34efb22b604a98198f24e347a6708beceb3f1',\n",
       " 'f99e341b406d4058ccf708600959e53b9afd9de4a3c883da7d5321dc34383955',\n",
       " 'ae139a9b519b7bec6d7fb52ddb34fca3f79e5d72879af7712db5e88edb967638',\n",
       " '73dc8bcae9d0e8a6d2889c3af30c4935cb4cdf99af5d141a0a09921f836e0121',\n",
       " '07c76851218bf9ffab5cd66e9e10addcb7f2bc622ff6adb7fbd9ed1d7e79ccdf',\n",
       " '56df4ec88803a915490771c5d8067a4d26c96a1caa13e7430eae704b2e00df7c',\n",
       " '7641976ec3f7fa69d4eccb57c587ba98ea3773968e87341d5664a4a5e0981a7f',\n",
       " '22eb486868684bdaad6a6e824af06f8a1db6e2eef99daa7212011d1f286d43da',\n",
       " '3f9fff4c4404d9982eda648b097f3680556346a7f30d498c523279f995c64cad',\n",
       " 'e8748fe252cfafaf7295b31236c7fb6bff899b8b4a70bdaa781bbd62651507e6',\n",
       " '7092d85f51f10b1927320cb8ce455b209653217dcc3484f0a2e5fc8803321f77',\n",
       " '69c2cce9b3bb4850bf289bc5470fb940b91e029828dd1e6afde3fab8389523a9',\n",
       " '22766b560d37c4515c11d1b78e3803accfb7ccb164aea8a77a071b4064046b28',\n",
       " '020f55cf53272928cf8b09630613c4c8c78ca63d34e6445c36b25d49e63239ea',\n",
       " '40c62805bbd118eb9cb40efe4cd7b4866b7d97f7d9cdb3406e0f3eff6047357d',\n",
       " '5bead5b23e00918ad9f11c785c5825613dae8e6692fd207c64930a5cb017dc3f',\n",
       " 'daa4f71cb9168916394bbe3f999375fd47bdb090878dbd80ead558510fc23fb7',\n",
       " '6bd51ae917bb314d98a026e8d705ecfb5e4e1c7caffca09bbfc9f38f0c7879f5',\n",
       " 'd4ee90675956e74048ddd2c21dcdba23478b3c2ac9a1cb313f4884720daae0b6',\n",
       " '807ac3ef3e9f958a2b9dda678b106a4f4c643d10bd44857d8e99c4b2b443d98e',\n",
       " 'f90ff22e0e2bfcf2b2edebd880edc8034faa6262fcd17d9499660bcc6fb28c94',\n",
       " '6ee2a5b224a04e2467f185598bac7405cac277e872796b01344dbb2d13682a75',\n",
       " '015d630a4110779a6c1534e2f60208d9442dc12f449b47aa8898a6b46eacc041',\n",
       " '0ec1d9c0b6dde4c3cadc80e8d23e6c77b24a1caa14bf06e4bf092316d6eb4576',\n",
       " 'b5de6ac3be687550f2256ca1cda7c67edc1495f1c8838f1b7bf26bacd85e8db7',\n",
       " '8a2f52f730cb06af2be6999b5755d42ce105b88c4594ae9e884bc1898e31f37a',\n",
       " '75cfdf6fd2c306e40846172d1fed33bf55243f504282c898bb6dcd657d922b4c',\n",
       " '08dcbba3ded55ca739fc6a181ca584aac78d844b5ca96cede7c671922c9833c2',\n",
       " '6c0d8f90b8dd4ee23a592a3c8561a7bfe79c0bfb001971997ba704243f8ffa89',\n",
       " 'bad1e6fbd512f344eb0e935359e992a4d43611875e7efc27050aba53f012aee3',\n",
       " '66175bd948e611e5984418471baba04a2e8f76ba362cd55d63211eae2f840035',\n",
       " '5b0b241b06921464158e089120037aed33a4b01c42f08a09dcd54e53a30fc0c0',\n",
       " '9535ab5a34f21b812998989d99b46394063b9cf61c595f6589930a106d8ebc4e',\n",
       " '66ec1c48cc711cd12e4f8982808f3db8cda62b215b17699727bc87110c592776',\n",
       " 'e42d56e4cf505025b77d08414c6e1cda0fc7c7108352d330dce5535dccb58acd',\n",
       " '4da476e8ba203c4d71a600a405ca5eab3eb5e2323a9089daba4b658b30ec5e11',\n",
       " 'b2e7f5fe684f77a7cc9c4105e942844a5f299180617546d011651dc89748ad5a',\n",
       " 'cb6c4d308f0ef855e9565848a819ca751d7b759aa0bcd9054f025db16dbc8620',\n",
       " 'cb6c4d308f0ef855e9565848a819ca751d7b759aa0bcd9054f025db16dbc8620',\n",
       " 'ee088bf6901de0e56880eef259502b2276d7f9cb411f80979f9bbf4df66dbf07',\n",
       " '52a53206434aee0d376fb9eafade13760ce4f094b697ff016a0d6af2e1282773',\n",
       " 'ce363f3b14f5a5dcf8e18474a816de3b286c3e43dcc3c378408151e5c0e4b1ab',\n",
       " 'c2085a2811095ed5c62526296eacf9e628e2cec852583975405a83025f12f9be',\n",
       " '28724bd0a862a058461bf5ee1311684162813c6ff370daafd9b5d6450e8fd33f',\n",
       " '4a08fdac47c1a864ca2a5cf0ebc8f8d59bc1588163f5587771b6d4f6df1391f7',\n",
       " '5d807b4ac4741d9bb939d8bf030ba605c3352966213a0b7db7361cac7b38edb9',\n",
       " '9cf13dc0775c56cfa58e48b4beb7e432c06ff50b7f7c5f86077323a1a35936b7',\n",
       " '70d6aaec970b10fe1583d9b6fab2e07645ad0b57bbbde090e3974a2ebc592d80',\n",
       " '9aec26fd82aba130134aa084194906f70289643da517a2c74fbaee4b5140b786',\n",
       " '5297b68468070e5ede71d3354ca00591721b2ba81edfb944ca32c43d7d1934fd',\n",
       " 'f4807e06b13b126e67250013831b88df4527a42157cd410efc11fc029d37a75b',\n",
       " '183f4f1a6527974d0057198baca587f1014b4efcfdfd484664a70d015d57f3cf',\n",
       " '99bea0989ae92d5c7b9dfe2e78be2ece25b262d00616920d2fdbec8ddb8e9b08',\n",
       " 'bfcf4b34a30878fbaf4673e3704a90de1d15461734905c0e3bcfee17b35bee55',\n",
       " '0eda249ecc275eb5dc0b3e1ed695e48f3fbcddaeabdc29b6f1476fd75cc17fc4',\n",
       " 'dcaf9cf63cddc165819837f1542152f9108d6ca87bd05bdf73648efd75fcb354',\n",
       " '8475029ab8f27f9c30070c841f544c028d5b92b6db5f67d4ef4a496eb0ff15be',\n",
       " 'f7ec66ff82751000b00cf4a7d08aa0a8515fb1b93cf364089f3b19dda33553dc',\n",
       " '1c75f77794129b7b04bd076cb8f0fe0e8e88730afe2b18a3b8504b911c59cb4c',\n",
       " 'bc781af401adf97a89e4687cdce4114722bf0ecd7b88d3334c636ea6abf3e6ff',\n",
       " 'adcfa83a526ef6cfef392fefeae00cd069d6c3824157bce62b591af6b1921988',\n",
       " '7cb27b7667fa7dec1a559ce17f8be5226f1b91da0cffecfc7e85513a5000dc13',\n",
       " '194e44d729da2746f80e4dbd1bc36b232bab66fe108b1e0f2070f700e7b0126b',\n",
       " '1631bc30615bb0f7be77bc8d0de1a68b4ec04a06ca328844b107c68d55086b5c',\n",
       " '74d2560dd7e31fb595baf88a3a7fa81d1f2ced111100a3a8ef42327ae56bd221',\n",
       " '35f3515130514b209691f3b5478809f3488cb02ad5325ac262bae4053dd408f9',\n",
       " 'b5e1b5204c0bd0af5322229f2e0a8e5d23906c5aa1c28bc6f460963dbf90ee82',\n",
       " 'f1105d0c21d2fa26f691c5e8c1cdfdd7fcc1f3466301a6d4bdb25ba203c88790',\n",
       " 'e7e92b71c3309073a7ad7934c8efc27143ce6f4ee9abf60cc2375eb26261aecc',\n",
       " 'd34b2052f230bc5d0a3e61e3f795909dd2a7a9dd16282e1bb72ed75579b8b1fe',\n",
       " '28d05875b9680f31e46b7bd341dec4164a8fe39196a1b62ffc4d2dccbd8f0c36',\n",
       " 'af08243936f071c755bb27604d6bd2bebe42a3aa6a412d7577db0ded5b281817',\n",
       " 'ce4b62c086451a8a906e35a101ff42e29d830f6ad05f6e66da15d7ceecb7ce4d',\n",
       " '8c36ef58c0e2821ad9fa666532219bc68c461fdbaf203bdd8e2cb9dbb51bed46',\n",
       " '1c505c3837ada4945f292ac6ee549a7070f234c0dc36342ecbbcb1bde7e9d571',\n",
       " 'bd243402c380f7ff3f358fbd88ada323a2a0efb00e88ff06f45e062062242ac4',\n",
       " '01d40ed17cf61d5fde81d221764c5bdb41f020cf646ef336a287778e3124d793',\n",
       " '88be90c16a8b45d5940327e2d145cab1b84e5bb3e2d25ef042aad4728a432291',\n",
       " '017b417f6e283040e25a264855f06c6d74678b727d017cdc982850a4728f5928',\n",
       " '14c965926aa41aaee279c43d6b6896b0aa9096fd4fd62b013009426438394554',\n",
       " '75faac7731721b48e4168082aa57fea4eb459712d23f0d680d10c85b2cfc563a',\n",
       " '7e20b17570c443263ada91b379357ffdb31c258644e1830dab1d355c21e88586',\n",
       " 'e9cb57933798c20cf533b71e015e336276c057d1f0c49fdaf149b05817c9867f',\n",
       " 'ef51392145fb450acb1cb5cc64f5391fb642762c45cb3403d73faa06acbd2a8a',\n",
       " '8a57c7350a646db9229e51ef15de5a991d2a46f10dfe8ff0558f22ea0f6b53ee',\n",
       " 'c01c171381008cdc5f99272857b3adcfdcff0a23e7dd235c2af440c32c33b0c0',\n",
       " 'cb660955ddb990058cff8f0d3730df98a7e43570636cc22976319d86a168392b',\n",
       " 'b5e5631c162400ee8430237fcc55d1fd9529bb1d5d64f73e8d0e604532e858f3',\n",
       " 'd69ee08d0bcb8ba17093e9e22028e3d29a7c34cc4ef05b9c63276209b61ca407',\n",
       " 'df2432d822e567c3d154176a0652b391546460545f10c42c978ca26cc66bfe3b',\n",
       " '550c84b178c10e89f626a0427132eeef66f385076414b79ceebbf669e29a2e8a',\n",
       " '08fd1c40281ca7321101348174bf044371a6a115549a075e8402aaebfbb7a8e3',\n",
       " 'f0ccb98a9b9015ad45932856b5d78f2731429cb6cfa44bf5720924a544176827',\n",
       " 'e88842515fa8c74284eaf8dd65b89c4ce7a77f7c48bb8c19f4c4b967d79e7261',\n",
       " '17f5c6a003a3ce21351b8d5167436fa1f617a60cb46f21cab6b6382d8e78d160',\n",
       " '5cf13ca513b598cb76d9bc20d6decef62726328843315286e406820236211620',\n",
       " '882fdadf9efb1264161221193e670f7d7d09866e2b6a24619c6ff0eea610634b',\n",
       " '08d228218207d13d464bd774a45e8626cd34777e5f74d007dc962364fcbe6a3a',\n",
       " 'b5079aea7d4f6da675ba24d3ce4f32f41e16a21cf602ab3f66e9fc4aefc908ca',\n",
       " 'e3d91a65e63fdb6836ad5002dd07328a7374781d9f4f9b9ae02d167c613eb80c',\n",
       " 'b0f92b4fa5fefb7ab1b1852b3ecd827f65d1baaae61e4df7e6149c8f5a5f864b',\n",
       " '24a34422363036ad152c6549e00995d4cf80c53eae3afcf8214d5ad97d1004e5',\n",
       " '072d5934d319e0d95982c73e4a1934b874877eeab201da013d8e2f7250e46222',\n",
       " 'a6c5ae4d80d048c60444d880e69d00071f9227415aab81de7754dfb2b06bcad9',\n",
       " '11805ebaaf4d8b641f7a05d5a47427399e67f2f769350729a674f146b3f764c6',\n",
       " '1add75b4f4fc4837a08b3d39247aee3eba7e41f90a8776b71f73b8549ea499dd',\n",
       " '0322f227d5307662fc06deba322075baeffc022e49f32d8a1fff167140ecd45a',\n",
       " '8c1aadd1ae65e64e0e4238043334c7eb7d3f2dd36d8e9282ac0c4c56bee5abea',\n",
       " 'ecff65ae38786759bfdd97aca49dd7f16abd35bfe8e2664cf289d23ae7afd066',\n",
       " '052d1e2e436c4840a319d169f468b75d5ce9a0cfd7d0f6a6315e653b1e223889',\n",
       " 'd5402cf2b94ab93d451dfbf46bac5c23dd7600095cbf2ae1ff976ebe3f2d3bd0',\n",
       " 'ebee190d77eae09932cedf4ee2c9176f5774d87f8b7b38c941549576778d9c8e',\n",
       " '7c8bff47bd5837e145a94f9a3592762a0a6d180a20b0d9b62a2e9281963d3f31',\n",
       " 'b4a75abc553d0af3b5c2e26d10d5edf76d561860402dc6c45a4dc63f5d5d2f99',\n",
       " '8b014eb61114b15320662fa2244e703a8631f2a077ab1a9843c34ecba53cfcbe',\n",
       " '92b2c6b3c6f713c9258ab206bf535f84b2d48aa833ea233db8df37d5b958fe38',\n",
       " 'c3db7072e42025ce89a1b10d6316655cd717e6cd3016a81e6680d77b4049676c',\n",
       " 'b951247f0a3925f5c1c65fa80feb543614126d40e63d7e7bf53e700170a09544',\n",
       " '57dfddad758be07e31f1a1de11344aaaf85a4d02021c889ef7e87fa30843db99',\n",
       " 'd605632d2de29a276a2a41ad620057bda1e96a81b18935f8544d5e273c33ae9c',\n",
       " '60d756291694f320c25472e31dbccffa1071f3b1e084dc0c2985d8f93f248dde',\n",
       " '4985b540f9e9709631b11839bb142661d3c93d4a53d9831df3b51eea2b97a047',\n",
       " '90fd41547ed5bc083594676ba20ce34799cd211cf27d1b98b85675810f063541',\n",
       " '3a833832a2247d2db69b6641fe294a87d8f4e85307d12a2347dd80a6f26e3912',\n",
       " '0ce5ce02a6678700f17a8ebc48b55a683a85748cc3e442f869637457df64f6a1',\n",
       " '1922ca552d13c757bef60bd42b2d070d84eec08c8fc7945c925a87162eb53ec2',\n",
       " 'b67234f8ce11515837ba618945fb9a40876c11a522f5f2311a78b201daf10e60',\n",
       " '1ae03886afd938b1bab311df9048b9b887e3c2f5fd2ebe7c88d35c67bb15aa76',\n",
       " 'd9372d2491190ba27ed8931929d028395ce022608bc6504bb40c0141c4f43d37',\n",
       " '9aa7ae8ee1079f1abefecbf971e759ac3a483411a65cba14a28895177d8d0d49',\n",
       " 'fdb0e7cbe3d7754cb9ba223e8b42af8b71f4840b6fe5c3ce5623a8c484764a02',\n",
       " '4d6b5a470d4a4186586a52b35cf1c7acd1b0657b410b7db5c7cf2bde6195b5cb',\n",
       " 'f699988e68bec9b9f1b9f629608d07a9818c66803e071bd9bedde299d268f591',\n",
       " '8eb95a83ccffe75bc5f4785e76e8721c7d3e88e52c6019e9896ca8588b266eda',\n",
       " '792159b5c5b00cea11c18647e799c4f56c9b6f084359f0171e7acad332c4cc79',\n",
       " 'ac35c6ce5d978c8196ee38abbd1e7095f50f361007d0bc2cf197e48292a7e998',\n",
       " '7ebffd0814de0f63f2e45e03189069d30668e3cb475e6dd945298f282d418d36',\n",
       " '23159eb1d3deddc762f315bf0bfa3bd39f22005ba49b615637ec39caf2a30990',\n",
       " 'b11bda12e68fb5882a61f98e90b6a81358d14bbbeaae3e4bc0618ced72b9005d',\n",
       " '0eaa95c469068d67c90a04f196af97e71cefd452bece553d9ec7d0a987373328',\n",
       " '3011b05c45110ace20168e7d1478cac1d7c1735821fb3c9b4c9775a3a800cabf',\n",
       " '47e7916c2ddd34751ccec97ce99ce8cb4280488c6a027d9dcbf7266687228569',\n",
       " '3b621db62d7d8f434c814d0931c9c19951c08d216fbbf299e2c4a6dd14c3053d',\n",
       " '2e26df0a5c44bd1ee8f7f38175447854962e756a2b1b0e7fcc9b702b3b560bb2',\n",
       " '51efb663737e0fcfbce64f2238f5dcc08fd01a3e4dc8812432dabd216be3b51b',\n",
       " 'f27cc52f65328821cddf1887c8e363e4d799d4ed67e7a43a493d3e952ec81303',\n",
       " 'd7a8b6395627c633a3d4fb0ffe842de26b81644d758c34c6ea007c679e1c9cc7',\n",
       " '77264e13afc79a47d6d6fc6d71e4d3ef7022ca25b6bac5d74dbebb2eaae86556',\n",
       " 'd898808fbbb29338c0b9582d304f0044eac2af966911b62f7d344d3b638e38b6',\n",
       " '2fd9ef77643b499a49c4b2e2ce5c05ecf4744c154f579e2d21bc37f72e560fc9',\n",
       " '995bec41d4afb4bbe03b7d3b65762697a1de4eacdad3820b43c0c5acb022c709',\n",
       " '298c37afa9ba743df7c3354b4024fa0e7245f1f510b72920cc940205e4b85c33',\n",
       " '56ebf08588c675d9b19330ac5282cae786f1b6483bf379c36cb4857bcd36dbe9',\n",
       " '96ddd43aef43963dfca183fc88d327c9a3b92010bd26f9776cc7487bd6b7cae8',\n",
       " '39d65ea054e5c6ffe270b7f140d166fed7e6dc40afb7b9def07a032e7a40e328',\n",
       " '3c900ea94e3e01e03b7e1bc8b971d90ae0816259e62aede9fee65445d5d73205',\n",
       " '318f9b848a04ca08272d97e35728f0a574c0e5387922d69bad7a9ebd0ffb8dc3',\n",
       " '710c78ec9b1c26d94fa70e499389748b14a06cfb3d053b323804ceb97105a35f',\n",
       " 'e2cdd1a93b8262d47c234ff324094da129d74704258b6f947353567f681663b3',\n",
       " '33fad980ec30d047faa5d83e083536bf3019d93775da55bfaddfe20d7de7c3bc',\n",
       " 'f6833f0bdd70627c0140455cfd1c8afa9da22bb96ed2f8cfd718d7773de32e0d']"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "#Query for TAs matching the Berlusconi Market pattern and pointing to an address from the vendor wallets.\n",
    "start_transactions = []\n",
    "\n",
    "for i in vendor_wallets.itertuples():\n",
    "\n",
    "    address = i.Address\n",
    "    observedChange = str(0.01 * 100000000)\n",
    "\n",
    "    neo_query = session.run(\"\"\"\n",
    "    WITH \n",
    "        '\"\"\" + address + \"\"\"' as start,\n",
    "        \"\"\" + observedChange + \"\"\" as usualChange\n",
    "    MATCH (payout:Transaction)-[RECEIVES]->(vendor:Address)\n",
    "    WHERE vendor.address = start and payout.outDegree = 2\n",
    "    WITH payout, usualChange\n",
    "    MATCH (payout)-[r1:RECEIVES]->(change1:Address)-[s:SENDS]->(payout2:Transaction)-[r2:RECEIVES]->(change2:Address)\n",
    "    WHERE 0.85 * usualChange <= r1.value <= 1.15 * usualChange\n",
    "    AND 0.85 * usualChange <= r2.value <= 1.15 * usualChange\n",
    "    AND r1.value = s.value\n",
    "    AND (change1.address STARTS WITH \"3\" OR change1.address STARTS WITH \"bc1\")\n",
    "    AND (change2.address STARTS WITH \"3\" OR change2.address STARTS WITH \"bc1\")\n",
    "    AND payout2.outDegree = 2\n",
    "    RETURN payout.txid\n",
    "    \"\"\")\n",
    "    \n",
    "    for r in neo_query:\n",
    "        start_transactions.append(str(r[0]))\n",
    "\n",
    "    \n",
    "display(start_transactions)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "7d6b792d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "274"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Combine starting points from the vendor wallets with previously identified BM payout transaction using manual inspection.\n",
    "payout_TAs = [\"0debe14ba12bc429ac4933dc61aa64695ee1e7e41ed9e9477e2e4382527a063b\", \n",
    "              \"e8748fe252cfafaf7295b31236c7fb6bff899b8b4a70bdaa781bbd62651507e6\", \n",
    "              \"4993349442303968c94b4a0b05ff49fc8543bcfd1c677bccc6001260891ca58d\", \n",
    "              \"c54c234e4e37feb1447f1a41ca6fd7293ce3af2ca3dd53c99a24007534b810fd\", \n",
    "              \"7b8d6e19864889cb639efe748f7d05840ace40f8353ca77660d96a04132ace1b\", \n",
    "              \"0d5da4185c73ffba8bc0407433761d61d6574d8499dea7a9f0b9268ac49b4357\",\n",
    "              \"e8babd3eefe845c02af052c3564e1e0a101df4d04f13f65445b9558eafced6d9\",\n",
    "              \"35f3515130514b209691f3b5478809f3488cb02ad5325ac262bae4053dd408f9\",\n",
    "              \"aced23e9637b1983f31558e14b6068a26b0b0c53d6154847e8506b5dd01e0e89\",\n",
    "              \"0c4d1db76001531703ac1d0c31d8950dcc57faeb3e2cff82cb70171105f57a4b\",\n",
    "              \"00dee16249a3cce46cef9d2b0b07cb789cac214e5e5266fbf082e5ed43a36d75\"]\n",
    "payout_TAs = payout_TAs + start_transactions\n",
    "len(payout_TAs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1d055717",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_822767/3048974890.py:83: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.\n",
      "  df_neo4j[\"VendorAddress\"] = pd.Series(vendor_addresses)\n",
      "/tmp/ipykernel_822767/3048974890.py:84: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.\n",
      "  df_neo4j[\"Amount\"] = pd.Series(amounts)\n",
      "/tmp/ipykernel_822767/3048974890.py:85: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.\n",
      "  df_neo4j[\"Date\"] = pd.Series(dates)\n",
      "/tmp/ipykernel_822767/3048974890.py:45: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.\n",
      "  df_neo4j[\"VendorAddress\"] = pd.Series(neo_results)\n",
      "/tmp/ipykernel_822767/3048974890.py:46: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.\n",
      "  df_neo4j[\"Amount\"] = pd.Series(neo_results2)\n",
      "/tmp/ipykernel_822767/3048974890.py:47: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.\n",
      "  df_neo4j[\"Date\"] = pd.Series(neo_results3)\n"
     ]
    }
   ],
   "source": [
    "#DF for final results\n",
    "potential_vendors = pd.DataFrame()\n",
    "observedChange = str(0.01 * 100000000)\n",
    "not_covered = payout_TAs\n",
    "covered = []\n",
    "ctr = 0\n",
    "\n",
    "while not_covered:\n",
    "    ctr = ctr+1\n",
    "    neo_results = []\n",
    "    neo_results2 = []\n",
    "    neo_results3 = []\n",
    "    neo_results4 = []\n",
    "    \n",
    "    # Pop the next txid to use\n",
    "    txid = not_covered.pop()\n",
    "    covered.append(txid)\n",
    "    \n",
    "    #Follow the change chain forward\n",
    "    #Matches the txid and returns the identified vendor, the amount paid to him,\n",
    "    #the date of the payout and the next payout TA in the chain\n",
    "    neo_query = session.run(\"\"\"\n",
    "    WITH '\"\"\" + txid + \"\"\"' as start,\n",
    "        \"\"\" + observedChange + \"\"\" as usualChange\n",
    "    MATCH (payout:Transaction)-[r:RECEIVES]->(change:Address)\n",
    "    WHERE payout.txid = start AND 0.85 * usualChange <= r.value <= usualChange * 1.15 AND payout.outDegree = 2\n",
    "    WITH payout, change\n",
    "    MATCH (payout)-[r:RECEIVES]->(vendor:Address)\n",
    "    WHERE vendor <> change \n",
    "    WITH vendor.address as vendor_address, r.value as amount, payout.date as date, change\n",
    "    MATCH (change)-[SENDS]->(next_payout:Transaction)\n",
    "    RETURN DISTINCT vendor_address, amount, date, next_payout.txid\n",
    "    \"\"\")\n",
    "    \n",
    "    #Resultset should be empty if the end of the payout chain is reached\n",
    "    if neo_query:\n",
    "        for r in neo_query:\n",
    "            neo_results.append(r[0])\n",
    "            neo_results2.append(r[1])\n",
    "            neo_results3.append(r[2])\n",
    "            neo_results4.append(r[3])\n",
    "\n",
    "        df_neo4j = pd.DataFrame()\n",
    "        #The line below can be uncommented to view where the change chain ends going forward.\n",
    "        #df_neo4j[\"Payout TA\"] = pd.Series(txid)\n",
    "        df_neo4j[\"VendorAddress\"] = pd.Series(neo_results)\n",
    "        df_neo4j[\"Amount\"] = pd.Series(neo_results2)\n",
    "        df_neo4j[\"Date\"] = pd.Series(neo_results3)\n",
    "        potential_vendors = pd.concat([potential_vendors,df_neo4j])\n",
    "        \n",
    "        #check for duplicates to reduce run time\n",
    "        if (neo_results4):\n",
    "            if str(neo_results4[0]) not in covered and str(neo_results4[0]) not in not_covered:\n",
    "                not_covered.append(str(neo_results4[0]))\n",
    "\n",
    "    #Follow the change chain backwards\n",
    "    vendor_addresses = []\n",
    "    amounts = []\n",
    "    dates = []\n",
    "    previous_payouts = []\n",
    "\n",
    "    neo_query = session.run(\"\"\"\n",
    "    WITH '\"\"\" + txid + \"\"\"' as start,\n",
    "        \"\"\" + observedChange + \"\"\" as usualChange\n",
    "    MATCH (change:Address)-[s:SENDS]->(payout2:Transaction)\n",
    "    WHERE payout2.txid = start AND 0.85 * usualChange <= s.value <= usualChange * 1.15 AND payout2.outDegree = 2\n",
    "    WITH change, s\n",
    "    MATCH (payout1:Transaction)-[r:RECEIVES]->(change)\n",
    "    WHERE r.value = s.value\n",
    "    WITH payout1, change\n",
    "    MATCH (payout1)-[r:RECEIVES]->(vendor:Address)\n",
    "    WHERE change <> vendor AND payout1.outDegree = 2\n",
    "    RETURN DISTINCT vendor.address, r.value, payout1.date, payout1.txid\n",
    "    \"\"\")\n",
    "\n",
    "    for r in neo_query:\n",
    "        vendor_addresses.append(r[0])\n",
    "        amounts.append(r[1])\n",
    "        dates.append(r[2])\n",
    "        previous_payouts.append(r[3])\n",
    "\n",
    "    df_neo4j = pd.DataFrame()\n",
    "    #The line below can be uncommented to view where the change chain ends going backwards.\n",
    "    #df_neo4j[\"Payout TA\"] = pd.Series(txid)\n",
    "    df_neo4j[\"VendorAddress\"] = pd.Series(vendor_addresses)\n",
    "    df_neo4j[\"Amount\"] = pd.Series(amounts)\n",
    "    df_neo4j[\"Date\"] = pd.Series(dates)\n",
    "    potential_vendors = pd.concat([potential_vendors,df_neo4j])\n",
    "    #Drop duplicates so the df doesn't bloat up \n",
    "    potential_vendors = potential_vendors.drop_duplicates()\n",
    "\n",
    "    #check for duplicates to reduce run time\n",
    "    for i in previous_payouts:\n",
    "        if i not in covered and i not in not_covered:\n",
    "            not_covered.append(i)\n",
    "            \n",
    "    if (ctr % 100 == 0):\n",
    "        potential_vendors.to_csv(\"potential_vendors.csv\")\n",
    "session.close()\n",
    "potential_vendors = potential_vendors.sort_values(by=\"Date\",ascending=True)\n",
    "potential_vendors = potential_vendors.reset_index(drop=True)\n",
    "display(potential_vendors)\n",
    "potential_vendors.to_csv(\"potential_vendors.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5b058823",
   "metadata": {},
   "outputs": [],
   "source": [
    "print(len(covered))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6142078c",
   "metadata": {},
   "source": [
    "#For every starting point: Follows the change chain forward and collects all potential vendor addresses + payout amount & date\n",
    "\n",
    "#DF for final results\n",
    "potential_vendors = pd.DataFrame()\n",
    "observedChange = str(0.01 * 100000000)\n",
    "payouts = payout_TAs.copy()\n",
    "\n",
    "while payouts:\n",
    "    #print(payout_TAs)\n",
    "    neo_results = []\n",
    "    neo_results2 = []\n",
    "    neo_results3 = []\n",
    "    neo_results4 = []\n",
    "    \n",
    "    # Pop the next txid to use\n",
    "    txid = payouts.pop()\n",
    "    \n",
    "    # Matches the txid and returns the identified vendor, the amount paid to him,\n",
    "    # the date of the payout and the next payout TA in the chain\n",
    "    neo_query = session.run(\"\"\"\n",
    "    WITH '\"\"\" + txid + \"\"\"' as start,\n",
    "        \"\"\" + observedChange + \"\"\" as usualChange\n",
    "    MATCH (payout:Transaction)-[r:RECEIVES]->(change:Address)\n",
    "    WHERE payout.txid = start AND 0.85 * usualChange <= r.value <= usualChange * 1.15 AND payout.outDegree = 2\n",
    "    WITH payout, change\n",
    "    MATCH (payout)-[r:RECEIVES]->(vendor:Address)\n",
    "    WHERE vendor <> change \n",
    "    WITH vendor.address as vendor_address, r.value as amount, payout.date as date, change\n",
    "    MATCH (change)-[SENDS]->(next_payout:Transaction)\n",
    "    RETURN DISTINCT vendor_address, amount, date, next_payout.txid\n",
    "    \"\"\")\n",
    "    \n",
    "    #Resultset should be empty if the end of the payout chain is reached\n",
    "    if neo_query:\n",
    "        for r in neo_query:\n",
    "            neo_results.append(r[0])\n",
    "            neo_results2.append(r[1])\n",
    "            neo_results3.append(r[2])\n",
    "            neo_results4.append(r[3])\n",
    "\n",
    "        df_neo4j = pd.DataFrame()\n",
    "        #The line below can be uncommented to view where the change chain ends going forward.\n",
    "        #df_neo4j[\"Payout TA\"] = pd.Series(txid)\n",
    "        df_neo4j[\"VendorAddress\"] = pd.Series(neo_results)\n",
    "        df_neo4j[\"Amount\"] = pd.Series(neo_results2)\n",
    "        df_neo4j[\"Date\"] = pd.Series(neo_results3)\n",
    "        potential_vendors = pd.concat([potential_vendors,df_neo4j])\n",
    "        \n",
    "        if neo_results4:\n",
    "            payouts.append(str(neo_results4[0]))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "893e9ee3",
   "metadata": {},
   "source": [
    "#Follows the change chain backwards and collects all potential vendor addresses + payout amount and date\n",
    "payouts = payout_TAs.copy()\n",
    "\n",
    "while payouts:\n",
    "    vendor_addresses = []\n",
    "    amounts = []\n",
    "    dates = []\n",
    "    previous_payouts = []\n",
    "    \n",
    "    txid = payouts.pop()\n",
    "\n",
    "    neo_query = session.run(\"\"\"\n",
    "    WITH '\"\"\" + txid + \"\"\"' as start,\n",
    "        \"\"\" + observedChange + \"\"\" as usualChange\n",
    "    MATCH (change:Address)-[s:SENDS]->(payout2:Transaction)\n",
    "    WHERE payout2.txid = start AND 0.85 * usualChange <= s.value <= usualChange * 1.15 AND payout2.outDegree = 2\n",
    "    WITH change, s\n",
    "    MATCH (payout1:Transaction)-[r:RECEIVES]->(change)\n",
    "    WHERE r.value = s.value\n",
    "    WITH payout1, change\n",
    "    MATCH (payout1)-[r:RECEIVES]->(vendor:Address)\n",
    "    WHERE change <> vendor AND payout1.outDegree = 2\n",
    "    RETURN DISTINCT vendor.address, r.value, payout1.date, payout1.txid\n",
    "    \"\"\")\n",
    "\n",
    "    for r in neo_query:\n",
    "        vendor_addresses.append(r[0])\n",
    "        amounts.append(r[1])\n",
    "        dates.append(r[2])\n",
    "        previous_payouts.append(r[3])\n",
    "\n",
    "    df_neo4j = pd.DataFrame()\n",
    "    #The line below can be uncommented to view where the change chain ends going backwards.\n",
    "    #df_neo4j[\"Payout TA\"] = pd.Series(txid)\n",
    "    df_neo4j[\"VendorAddress\"] = pd.Series(vendor_addresses)\n",
    "    df_neo4j[\"Amount\"] = pd.Series(amounts)\n",
    "    df_neo4j[\"Date\"] = pd.Series(dates)\n",
    "    potential_vendors = pd.concat([potential_vendors,df_neo4j])\n",
    "\n",
    "    for i in previous_payouts:\n",
    "        payouts.append(i)\n",
    "        \n",
    "session.close()\n",
    "potential_vendors = potential_vendors.sort_values(by=\"Date\",ascending=True)\n",
    "potential_vendors = potential_vendors.reset_index(drop=True)\n",
    "display(potential_vendors)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c9dae672",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Drop duplicates in case some of the change chains overlapped.\n",
    "potential_vendors = potential_vendors.drop_duplicates()\n",
    "display(potential_vendors)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1df6fe0e",
   "metadata": {},
   "outputs": [],
   "source": [
    "berlusconi_reviews"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "728951ea",
   "metadata": {},
   "outputs": [],
   "source": [
    "#For every potential vendor address check whether a matching BM review exists. Gather matches in payout_review_matches.\n",
    "payout_review_matches = pd.DataFrame()\n",
    "\n",
    "for idx, payout in potential_vendors.iterrows():\n",
    "    for idx2, review in berlusconi_reviews.iterrows():\n",
    "        if (payout.Date == pd.to_datetime(review.time).date() + timedelta(days=2)) & (0.9 * review.price_btc_reviews_satoshi <= payout.Amount <= review.price_btc_reviews_satoshi):\n",
    "            temp = pd.DataFrame({\"VendorAddress\": [payout.VendorAddress],\"Date\": [payout.Date],\"PayoutAmount\": [payout.Amount],\"ReviewAmount\": [review.price_btc_reviews_satoshi],\"amountDifference\": [abs(review.price_btc_reviews_satoshi-payout.Amount)],\"VendorID\": [review.vendor_id],\"ReviewID\": [review.vendor_review_id]})\n",
    "            payout_review_matches = pd.concat([payout_review_matches, temp])\n",
    "            \n",
    "\n",
    "payout_review_matches = payout_review_matches.reset_index(drop=True)\n",
    "display(payout_review_matches.sort_values(by=[\"VendorAddress\", \"ReviewAmount\"], ascending=[True, True]))                                                     "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "21b5c9de",
   "metadata": {},
   "outputs": [],
   "source": [
    "payout_review_matches.to_csv(\"payout_review_matches2.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "99225e15",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
