{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import tqdm\n",
    "import pickle\n",
    "import pandas as pd\n",
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_pw = pd.read_csv(\"pw.csv\", delimiter=\",\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "db = GraphDatabase.driver(\"neo4j://127.0.0.1:7687\", auth=(df_pw[\"name\"][0], df_pw[\"password\"][0]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "sess = db.session()\n",
    "result = sess.run(\"MATCH (n:Transaction) Where date ({year: 2019, month: 7}) >n.date >= date({year: 2017, month: 8}) RETURN n LIMIT 25\")\n",
    "results = []\n",
    "for r in result:\n",
    "    results.append(r[0])\n",
    "df_neo4j = pd.DataFrame(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "10\n",
      "11\n",
      "12\n",
      "13\n",
      "14\n",
      "15\n",
      "16\n",
      "17\n",
      "18\n",
      "19\n",
      "20\n",
      "21\n",
      "22\n",
      "23\n",
      "24\n",
      "25\n",
      "26\n",
      "27\n",
      "28\n",
      "29\n",
      "30\n",
      "31\n",
      "32\n",
      "33\n",
      "34\n",
      "35\n",
      "36\n",
      "37\n",
      "38\n",
      "39\n",
      "40\n",
      "41\n",
      "42\n",
      "43\n",
      "44\n",
      "45\n",
      "46\n",
      "47\n",
      "48\n",
      "49\n",
      "50\n",
      "51\n",
      "52\n",
      "53\n",
      "54\n",
      "55\n",
      "56\n",
      "57\n",
      "58\n",
      "59\n",
      "60\n",
      "61\n",
      "62\n",
      "63\n",
      "64\n",
      "65\n",
      "66\n",
      "67\n",
      "68\n",
      "69\n",
      "70\n",
      "71\n",
      "72\n",
      "73\n",
      "74\n"
     ]
    }
   ],
   "source": [
    "sess = db.session()\n",
    "df_neo4j=pd.DataFrame([[1]], columns=[0])\n",
    "count=0\n",
    "while df_neo4j[0][0]>0:\n",
    "    result = sess.run(\"MATCH (t:Transaction) WHERE t.date < date({year: 2017, month: 8}) OR t.date >= date({year: 2019, month: 7}) with t LIMIT 10000 DETACH DELETE t  RETURN count(*)\")\n",
    "    results = []\n",
    "    for r in result:\n",
    "        results.append(r[0])\n",
    "    df_neo4j = pd.DataFrame(results)\n",
    "    count+=1\n",
    "    print(count)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "sess = db.session()\n",
    "df_neo4j=pd.DataFrame([[1]], columns=[0])\n",
    "count=0\n",
    "while df_neo4j[0][0]>0:\n",
    "    result = sess.run(\"MATCH (a:Address) where NOT (a)-[:RECEIVES]-(:Transaction) and not (a)-[:SENDS]-(:Transaction) with a limit 10000 Delete a\")\n",
    "    results = []\n",
    "    for r in result:\n",
    "        results.append(r[0])\n",
    "    df_neo4j = pd.DataFrame(results)\n",
    "    count+=1\n",
    "    print(count)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>outDegree</th>\n",
       "      <th>date</th>\n",
       "      <th>inDegree</th>\n",
       "      <th>inSum</th>\n",
       "      <th>outDegree</th>\n",
       "      <th>outSum</th>\n",
       "      <th>txid</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>2017-08-01</td>\n",
       "      <td>3</td>\n",
       "      <td>74487394</td>\n",
       "      <td>2</td>\n",
       "      <td>74455044</td>\n",
       "      <td>0000cf005a216d1349b83c1a7c280f6c937c42fe9368d0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>2017-08-01</td>\n",
       "      <td>1</td>\n",
       "      <td>675170</td>\n",
       "      <td>2</td>\n",
       "      <td>644603</td>\n",
       "      <td>0001b3df1802c58cf4a05f940208b72675bb7c54d55dfc...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>2017-08-01</td>\n",
       "      <td>1</td>\n",
       "      <td>2320000</td>\n",
       "      <td>1</td>\n",
       "      <td>2318845</td>\n",
       "      <td>0001decf9d483589e048b0435aab6be77856e637e298e1...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2</td>\n",
       "      <td>2017-08-01</td>\n",
       "      <td>2</td>\n",
       "      <td>2015135360</td>\n",
       "      <td>2</td>\n",
       "      <td>2015105440</td>\n",
       "      <td>0001fe15fc0f0cded30473a26d8aaefc23f28ae96dd226...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2</td>\n",
       "      <td>2017-08-01</td>\n",
       "      <td>1</td>\n",
       "      <td>143376165</td>\n",
       "      <td>2</td>\n",
       "      <td>143326404</td>\n",
       "      <td>00023dafdd79df57d7c93ffb19134e6ca2137690ef41d3...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    outDegree        date  inDegree       inSum  outDegree      outSum  \\\n",
       "0           2  2017-08-01         3    74487394          2    74455044   \n",
       "1           2  2017-08-01         1      675170          2      644603   \n",
       "2           1  2017-08-01         1     2320000          1     2318845   \n",
       "3           2  2017-08-01         2  2015135360          2  2015105440   \n",
       "4           2  2017-08-01         1   143376165          2   143326404   \n",
       "\n",
       "                                                txid  \n",
       "0  0000cf005a216d1349b83c1a7c280f6c937c42fe9368d0...  \n",
       "1  0001b3df1802c58cf4a05f940208b72675bb7c54d55dfc...  \n",
       "2  0001decf9d483589e048b0435aab6be77856e637e298e1...  \n",
       "3  0001fe15fc0f0cded30473a26d8aaefc23f28ae96dd226...  \n",
       "4  00023dafdd79df57d7c93ffb19134e6ca2137690ef41d3...  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_neo4j.head()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
